examples/workflows/poiseuille_flow/PoiseuilleFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


L 					L_var;
A 					A_var;
B 					B_var;
hx 				hx_var;
hy 				hy_var;
hz 				hz_var;

convertToMeters 1;

vertices
(
	(0 0 0)
   ($L 0 0)
    ($L $A 0)
   (0 $A 0)
	(0 0 $B)
    ($L 0 $B)
    ($L $A $B)
    (0 $A $B)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($hx $hy $hz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
